vault backup: 2026-07-11 01:52:56: change from ascii diagram to mermaid diagram
